# DBeam_ShowBeamLines

```pascal
PROCEDURE DBeam_ShowBeamLines(showFlag : BOOLEAN);
```

```python
def vs.DBeam_ShowBeamLines(showFlag):
    return None
```

## Parameters
|Name|Type|Description|
|---|---|---|
|showFlag|BOOLEAN|   |

## Version
Availability: from Vectorworks 2011

## Category
* Spotlight